from app.services.llm_service import get_llm_response
from app.services.search_service import search_web

async def run_competitor_analysis(framing_context: str, market_data: str) -> str:
    """
    Знаходить прямих конкурентів і робить аналіз конкурентного середовища.
    """
    
    # 1. Генеруємо запит на пошук конкурентів
    query_prompt = f"""
    Задача: {framing_context}
    Ринок: {market_data}
    
    Напишіть пошуковий запит для Google, щоб знайти 3-5 прямих конкурентів у цій ніші та їхні ціни/відгуки.
    Також пошукай стартапи, які ЗАКРИЛИСЬ у цій ніші.
    Тільки текст запиту.
    """
    search_query = await get_llm_response(query_prompt, agent="competitor_agent")
    
    # Обрізаємо запит до максимальної довжини Tavily API (400 символів)
    if len(str(search_query)) > 400:
        search_query = str(search_query)[:397] + "..."
    
    print(f"   [Competitor Agent] Searching: {search_query}")

    if not search_query or str(search_query).strip() == "N/A":
        return "N/A"
    
    search_results = await search_web(search_query)
    # Guard against context-length errors from very large web dumps
    if isinstance(search_results, str) and len(search_results) > 6000:
        search_results = search_results[:6000] + "\n\n[truncated]"
    
    # 2. Аналіз конкурентів
    analysis_prompt = f"""
    Ти - Competitive Analysis Agent. Твоя мета - ЗАХИСТИТИ клієнта від виходу на програшний ринок.
    
    ⚠️ ТВОЯ МІСІЯ: Показати РЕАЛЬНУ картину конкуренції, а не "все буде добре".
    
    Вхідні дані:
    {framing_context}
    
    Знайдені конкуренти:
    {search_results}
    
    ### ФОРМАТ ЗВІТУ (КОРОТКО!):
    
    ## 🎯 Конкуренти
    
    | Назва | Сильні сторони | Слабкості | Ціни |
    |-------|----------------|-----------|------|
    (Топ-3 конкуренти)
    
    **🪦 Провали:** Хто закрився і чому? (1-2 приклади або "дані не знайдено")
    
    ## 🎯 Вердикт
    - **Складність входу:** 🟢 Легко / 🟡 Складно / 🔴 Дуже важко
    - **Мін. бюджет:** $X/міс на маркетинг
    - **Час до впізнаваності:** X місяців
    - **Біла пляма:** Що конкуренти роблять погано? (1 пункт)
    
    Будь ЛАКОНІЧНИМ. Максимум 120 слів.
    """
    
    return await get_llm_response(analysis_prompt, temperature=0.3, agent="competitor_agent")