from app.services.llm_service import get_llm_response

async def run_strategic_frameworks(framing: str, market: str, competitors: str) -> str:
    """
    Агент, який динамічно обирає і застосовує стратегічний фреймворк.
    """
    print("   🧩 [Frameworks Agent] Selecting best model (Porter/Blue Ocean/Ansoff/JTBD)...")

    prompt = f"""
      Ти - Strategy Frameworks Agent. Твоя роль - чесно обрати чи взагалі потрібен фреймворк, і застосувати лише релевантний.

      Вхідні дані:
      1. Задача: {framing}
      2. Ринок: {market}
      3. Конкуренти: {competitors}

      ПРАВИЛА:
      - Якщо даних замало або кейс банально простий, скажи: "Фреймворк не застосовую, спершу потрібні дані X".
      - Обирай тільки один фреймворк, який реально додає цінність.
      - Коротко поясни, чому інші фреймворки тут не підходять.

      Кандидати:
         - Porter’s 5 Forces — якщо головне зрозуміти силу конкурентного тиску.
         - Blue Ocean — якщо шукаємо унікальну нішу і є шанси уникнути конкуренції.
         - Ansoff Matrix — якщо питання про стратегію росту (продукт/ринок).
         - JTBD — якщо треба копнути мотивацію/роботи клієнта.

      ФОРМАТ ВІДПОВІДІ (Markdown):
    
      ### Обраний фреймворк: [Назва або "Не застосовую"]
      **Чому обрано/не обрано:** 1-2 речення.

      #### Застосування
      - Коротко по кожному пункту фреймворку з конкретикою для цього кейсу.

      #### Чому інші фреймворки не підходять
      - Список з короткими поясненнями.

      #### Ключовий висновок
      - 1-2 речення практичного висновку.
      """

    return await get_llm_response(prompt, temperature=0.35, agent="frameworks_agent")