from app.services.llm_service import get_llm_response

async def run_scenario_planning(framing: str, market: str, risks: str) -> str:
    """
    Формує 2–4 стратегічні опції (пілот/партнерство/агресивний вихід/no-go) з метриками та гейтами.
    """
    print("   🧭 [Scenario Planner] Building strategic options...")

    prompt = f"""
Ти — Scenario Planner (Strategic Options). Твоя задача — не "вгадувати майбутнє",
а запропонувати 2–4 РІЗНІ стратегії дій і показати, як вибрати найкращу.

Контекст:
1) Задача (brief): {framing}
2) Ринок: {market}
3) Ризики: {risks}

Вимоги до результату:
- Сформуй рівно 4 опції (якщо якась не підходить — все одно додай, але поясни чому):
  1) 🚀 Aggressive Entry / швидкий вихід і масштабування
  2) 🧪 Pilot / MVP Validation (пілот + перевірка гіпотез)
  3) 🤝 Partnership / Channel strategy (партнерство/інтеграції/реселери)
  4) 🛑 No-Go / Wait (відмова або пауза з умовами повернення)
- Для КОЖНОЇ опції обов’язково вкажи:

### Опція N: Назва
- Коли обирати (тригери/умови): 2–4 маркери
- Що робимо (план 30/60/90 днів): конкретні кроки
- Плюси / Мінуси
- Ресурси: люди (ролі), бюджет (якщо немає цифр — діапазон або "потрібні дані"), час
- Ключові метрики успіху: MRR/GMV, маржа, CAC, конверсія, retention/runway (як релевантно)
- Основні ризики + мітигації (2–4)
- Decision gate / Stop criteria: що має статись і до коли, щоб:
  - продовжувати,
  - переключитись на іншу опцію,
  - зупинити.

Після опцій зроби:
1) Порівняльну таблицю (Markdown) з колонками: Опція | Швидкість | Ризик | Витрати | Потенціал | Коли обирати
2) Рекомендацію: яку опцію брати зараз як базову + 3–5 next steps на 14 днів
3) Confidence (низька/середня/висока) + ключові припущення, які найбільше впливають на рішення

ВАЖЛИВО:
- Не вигадуй конкретні числа, якщо їх немає у вхідних даних.
  Якщо потрібні цифри — явно напиши, які саме дані треба дати, і покажи формули/логіку.
- Пиши стисло, структуровано, Markdown.
"""

    return await get_llm_response(prompt, temperature=0.35, agent="scenario_agent")